{"title":"Kurationsmodul für The ICONIST | Tagebucheintrag | graphicore.de","languageSwitch":"<ul class=\"language-switch\"><li title=\"Zeige diese Seite auf Deutsch. Die Benutzerschnittstelle ist übersetzt, aber nicht unbedingt alle Artikel.\" class=\"first de active\"  ><a hreflang=\"de\" rel=\"alternate\" href=\"\/de\/archive\/2013-11-12_iconic_imports\">Deutsch<\/a><\/li><li title=\"Display this page in English. The interface is translated, but not all articles necessarily are.\" class=\"en\"  ><a hreflang=\"en\" rel=\"alternate\" href=\"\/en\/archive\/2013-11-12_iconic_imports\">English<\/a><\/li><\/ul>","type":"content","html":"<div class=\"contentContainer diaryEntry\" xml:lang=\"de\" lang=\"de\"><h1>Kurationsmodul für The ICONIST<\/h1><p class=\"teaser\">Auf der Seite von The ICONIST werden täglich »handverlesene Home &amp; Living Produkte« präsentiert. Für Compuccino habe ich den ersten Schritt des Kurationsprozesses geschrieben.<\/p><div class=\"gridRow\">\n<p>Link zur Seite: <a href=\"http:\/\/iconist.de\">The ICONIST<\/a>, obwohl was ich gemacht habe nicht direkt online gesehen werden kann.<\/p>\n<\/div>\n\n<h2>Import und Synchronisierung<\/h2>\n<div class=\"gridRow\">\n<div class=\"gridWidth5 gridPos0\">\n<p>\nDas Programm sammelt Produktdaten von vielen verschiedenen Anbietern. Dabei kommt ein Adapter-Konzept zum Einsatz, welches aus den unterschiedlichen Anbieterformaten eine einheitliche Repräsentation in der Datenbank ablegt. Es werden hunderttausende verschiedene Produkte importiert und aktuell gehalten. Der Import wird via Cron-Job automatisch angestoßen, kann aber auch über das Webinterface gestartet werden.\n<\/p>\n<\/div><div class=\"gridWidth5 gridPos5\"><p>\nDurch einen Locking-Mechanismus wird verhindert, dass die gleiche Quelle zur selben Zeit mehrfach importiert werden kann. Der Importstatus lässt sich jederzeit, auch während des laufenden Imports, ermitteln. Er kann über das Webinterface und für den Administrator mit dem Terminal abgefragt werden. Der Importer erkennt Änderungen an den einzelnen Produkten, sowie die Löschung von Produkten durch den Anbieter.\n<\/p>\n<\/div><\/div>\n\n\n<h2>Kuration Webinterface<\/h2>\n<div class=\"gridRow\">\n<p>\n<img src=\"\/images\/diary\/iconic_imports.png\" alt=\"Screenshot Kurationsinterface\" \/><\/p>\n<\/div>\n\n<div class=\"gridRow\">\n<div class=\"gridWidth5 gridPos0\">\n<p>\nDie Redakteure wählen Produkte zur weiteren Auswahl und zur Anreicherung der Daten aus. Das Webinterface bietet zahlreiche Filter, um der großen Datenmenge Herr zu werden. Neben sehr einfachen Filteroptionen wie »Shop« oder »Preisspanne« steht eine Stichwortsuche und ein Filter für Kategorien zur Verfügung. Die von Anbieter zu Anbieter verschiedenen Kategorien können auf einem einheitlichen Kategoriebaum im Kurationsmodul abgebildet werden. Der Kategoriebaum kann im Webinterface erstellt werden, die Zuordnung von fremden Kategorien auf eigene Kategorien wird von einem Redakteur durchgeführt.\n<\/p>\n<\/div><div class=\"gridWidth5 gridPos5\">\n<p>\nIn der Datenbank kommen zwei Konzepte zum Darstellen des Kategoriebaums gleichzeitig zum Einsatz: eine <a href=\"http:\/\/de.wikipedia.org\/wiki\/Adjazenzliste\">Adjazenzliste<\/a>, das heisst jede Kategorie kennt ihre Elternkategorie. Damit ist die Verwaltung des Baumes recht einfach umsetzbar. Ausserdem werden auch die Informationen des <a href=\"http:\/\/de.wikipedia.org\/wiki\/Nested_Sets\">Nested-Set Models<\/a> mit den Kategorien abgelegt. Damit ist die Abfrage des Baumes sehr performant und einfach möglich.<\/p><p>\nFür den Kurationsprozess habe ich eine kleine JavaScript Anwendung geschrieben, die, durch die Verwendung von AJAX, Ladezeiten deutlich verkürzt und die Serverprogrammierung stark vereinfacht hat. Beispielsweise erfolgt die Verwaltung des Anwendungsstatus im Client und musste daher nicht mit serverseitigen Sessions umgesetzt werden.\n<\/p>\n<\/div><\/div>\n<h2>Technologie<\/h2>\n<div class=\"gridRow\">\n<p>\nDer Servercode ist mit PHP 5 geschrieben. Ich habe Composer mit Symphony 2 als Framework verwendet und habe einiges selbst geschrieben. Im Webinterface kommen RequireJS und jQuery zum Einsatz, und auch eine ganze Hand voll eigener Module.\n<\/p>\n<\/div>\n<div class=\"diaryEntryFooter\"><a class=\"permalink\" href=\"\/de\/archive\/2013-11-12_iconic_imports\">Permalink<\/a> Dienstag, 12. November 2013 16:53:17 Europe\/Berlin<div class=\"filters\">Filter: <ul><li><a rel=\"tag\" href=\"\/de\/diary\/code\">Web und Code<\/a><\/li><\/ul><\/div><\/div><\/div>"}