{"title":"silber-und-blei.com | Tagebucheintrag | graphicore.de","languageSwitch":"<ul class=\"language-switch\"><li title=\"Zeige diese Seite auf Deutsch. Die Benutzerschnittstelle ist übersetzt, aber nicht unbedingt alle Artikel.\" class=\"first de active\"  ><a hreflang=\"de\" rel=\"alternate\" href=\"\/de\/archive\/2013-11-12_silber-und-blei\">Deutsch<\/a><\/li><li title=\"Display this page in English. The interface is translated, but not all articles necessarily are.\" class=\"en\"  ><a hreflang=\"en\" rel=\"alternate\" href=\"\/en\/archive\/2013-11-12_silber-und-blei\">English<\/a><\/li><\/ul>","type":"content","html":"<div class=\"contentContainer diaryEntry\" xml:lang=\"de\" lang=\"de\"><h1>silber-und-blei.com<\/h1><p class=\"teaser\">Unsere Website von Silber &amp; Blei ist online.<\/p><div class=\"gridRow\">\n<p>Link zur Seite: <a href=\"https:\/\/silber-und-blei.com\">Silber &amp; Blei<\/a><\/p>\n<\/div>\n\n<div class=\"gridRow\">\n<div class=\"gridWidth9 gridPos0\">\n<p><img src=\"\/images\/diary\/silber-und-blei-screenshot.png\" alt=\"Screenshot silber-und-blei.com 2 Responsive-Stufen\" title=\"Screenshot der Silber und Blei Website\" \/><\/p>\n<\/div>\n<\/div>\n\n\n<div class=\"gridRow\">\n<div class=\"gridWidth3 gridPos0\">\n<h2>Webdesign<\/h2>\n<p>\nDas Webdesign ist von uns, genau wie die Umsetzung. Wir haben dabei auf aktuelle Technologie gesetzt und eine gediegene Seite gestaltet. Es sind schöne Webfonts im Einsatz und die Seite ist responsive. Sie passt sich an die Größe des Browserfensters an, sodass sie mit auf dem Smartphone sowie auf dem Desktop optimal lesbar bleibt.\n<\/p>\n<\/div><div class=\"gridWidth4 gridPos3\">\n<h2>Statisch generiert mit Hyde\/Python<\/h2>\n<p>\nAuf dem Server liegt eine komplett statische Seite, nur HTML-Dateien. Der Trick: die Seite wird mit dem statischen Websitegenerator <a href=\"http:\/\/hyde.github.io\/\">Hyde<\/a> generiert und dann hochgeladen. Das hat enorme Vorteile: die Seite ist schnell, sicher, wartungsarm und trotzdem noch komfortabel bedienbar.\nAuf einen Newsfeed wollten wir nicht verzichten, der wird von Hyde im ATOM-Format generiert. Hyde haben wir mit einem Plugin für unsere Bildergalerien erweitert, dazu aber gleich mehr.\n<\/p>\n<\/div><div class=\"gridWidth3 gridPos7\">\n\n<h2>Die Bildergalerie<\/h2>\n\n<p>Da wir unsere Bilder besonders schön präsentieren wollen, haben wir uns mit der Bildergalerie große Mühe gegeben. Das Kernstück der Galerie ist der Albumbetrachter. Ich habe hier ein paar beachtlichen Eigenschaften des Sliders zusammengefasst.<\/p>\n<p>\nHier eingebettet das Album »<a href=\"https:\/\/silber-und-blei.com\/galerie\/Neueste_Bilder.html\">Neuste Bilder<\/a>« von Silber und Blei:\n<\/p>\n<\/div><\/div>\n\n<iframe\n  width=\"100%\"\n  height=\"736px\"\n  src=\"https:\/\/silber-und-blei.com\/galerie\/embed\/Neueste_Bilder.html\"\n  allowfullscreen\n  frameBorder=\"0\"><\/iframe>\n\n\n<div class=\"gridRow\">\n<div class=\"gridWidth2 gridPos0\">\n<h3>responsive<\/h3>\n<p>\nDer Albumbetrachter ist komplett responsive und stellt sich voll auf die Bildschirmgröße ein. Das könnt ihr auf einer <a href=\"http:\/\/silber-und-blei.com\/galerie\/Friedhofsengel.html\">Albumseite<\/a> gerne ausprobieren. Einfach an der Größe des Browserfensters spielen und sehen, was passiert.\n<\/p>\n<\/div><div class=\"gridWidth2 gridPos2\">\n<h3>vielseitig<\/h3>\n<p>Es gibt verschiedene Fälle, in denen ein Album eingebunden werden kann. Einerseits die Seite des Albums selbst, andererseits kann ein Album auch immer auf anderen Seiten eingebunden werden. Zusätzlich haben die Alben eine eigene Adresse um sie als Iframe auf anderen Websites einzubetten. Sofern es der Browser unterstützt kann bei uns ein Album sogar in den Vollbildmodus versetzt werden.\n<\/p>\n<\/div><div class=\"gridWidth2 gridPos4\">\n<h3>einbettbar<\/h3>\n<p>Wie hier auf der Seite zu sehen ist, kann ein Album auf einer anderen Website einebettet werden. Dafür werden spezielle html Seiten generiert. Ein Album kennt die Adresse seiner Embed-Version und bietet einen kleinen Code-Generator an. Dank der großen Anpassungsfähigkeit des Sliders in Sachen Format haben wir darauf verzichtet, feste Größen vorzuschreiben. Der Autor der fremden Seite hat dadurch die Möglichkeit, das Album genau richtig einzupassen. Wir hoffen natürlich, mit dieser Funktion eine größere Reichweite zu erzielen, und würden uns sehr über Sichtungen unserer Alben in der freien Wildbahn freuen.\n<\/p>\n<\/div><div class=\"gridWidth2 gridPos6\">\n<h3>universell<\/h3>\n<p>Jede Instanz eines Albums verwendet den gleichen Code, sei es nun im Iframe oder auf der Albumwebsite. Er ist eine Weiterentwicklung des Codes von <a href=\"\/de\/archive\/2013-01-31_big-business\">das Auto. Magazine<\/a>. Die Thumbnails und die große Ansicht der Bilder werden von der gleichen Basis betrieben. Durch Erweiterung der Objekte und unterschiedliche Konfiguration kommen die verschiedenen Erscheinungsformen zustande. Für den Wechsel in den Vollbild-Modus muss nicht einmal das Album neu initialisiert werden.\n<\/p>\n<\/div><div class=\"gridWidth2 gridPos8\">\n<h3>einfach<\/h3>\n<p>Für die Bildverwaltung haben wir ein Plugin für Hyde in Python geschrieben. Das Plugin generiert Thumbnails und die großen Bilder eines Albums beim Erstellen der Seite. Bei einem Album handelt es sich um eine Konfigurationsdatei, in der die Liste der Bilder zu finden ist. Um ein Album einzubetten reicht es, den internen Namen zu kennen: <code title=\"jinja2 ist die verwendete Template Sprache\">{{make_album( 'Neueste_Bilder', ['autoplay', 'no-thumbs']) }}<\/code>. Das Beispiel ist dierekt von unserer Startseite entnommen.\n<\/p>\n<\/div><\/div><div class=\"diaryEntryFooter\"><a class=\"permalink\" href=\"\/de\/archive\/2013-11-12_silber-und-blei\">Permalink<\/a> Dienstag, 12. November 2013 18:50:43 Europe\/Berlin<div class=\"filters\">Filter: <ul><li><a rel=\"tag\" href=\"\/de\/diary\/news\">Neues<\/a><\/li><li><a rel=\"tag\" href=\"\/de\/diary\/graphicdesign\">Grafikdesign<\/a><\/li><li><a rel=\"tag\" href=\"\/de\/diary\/conception\">Konzeption<\/a><\/li><li><a rel=\"tag\" href=\"\/de\/diary\/code\">Web und Code<\/a><\/li><\/ul><\/div><\/div><\/div>"}