{"title":"Curation Module for The ICONIST | Diary entry | graphicore.de","languageSwitch":"<ul class=\"language-switch\"><li title=\"Zeige diese Seite auf Deutsch. Die Benutzerschnittstelle ist übersetzt, aber nicht unbedingt alle Artikel.\" class=\"first de\"  ><a hreflang=\"de\" rel=\"alternate\" href=\"\/de\/archive\/2013-11-12_iconic_imports\">Deutsch<\/a><\/li><li title=\"Display this page in English. The interface is translated, but not all articles necessarily are.\" class=\"en active\"  ><a hreflang=\"en\" rel=\"alternate\" href=\"\/en\/archive\/2013-11-12_iconic_imports\">English<\/a><\/li><\/ul>","type":"content","html":"<div class=\"contentContainer diaryEntry\" xml:lang=\"en\" lang=\"en\"><h1>Curation Module for The ICONIST<\/h1><p class=\"teaser\">At the site of The ICONIST »hand-picked home &amp; living products« are presented on a daily base. I wrote the first steps of the curation process for Compuccino.<\/p><div class=\"gridRow\">\n<p>Link to the Site: <a href=\"http:\/\/iconist.de\">The ICONIST<\/a> although what I did can't be viewed directly online.<\/p>\n<\/div>\n\n<h2>Import and Synchronization<\/h2>\n<div class=\"gridRow\">\n<div class=\"gridWidth5 gridPos0\">\n<p>\nThe programm collects product data of many different providers. Therefore an adapter Concept is used. Coming from different provider formats a unified representation is stored in the database. Hundreds of thousands of different products are beeing imported and kept up-to-date. The import is triggered via cron job automatically but it can be started through the webinterface, too.\n<\/p>\n<\/div><div class=\"gridWidth5 gridPos5\"><p>\nA locking mechanism prevents that the same source is beeing multiply imported at the same time. The import state can be determined at any time, even when the import is run by another process. It can be queried with the web interface and as the admin with the terminal. The importer recognizes updates of the particular products as well as the deletion of products by the provider.\n<\/p>\n<\/div><\/div>\n\n\n<h2>Curation Webinterface<\/h2>\n<div class=\"gridRow\">\n<p>\n<img src=\"\/images\/diary\/iconic_imports.png\" alt=\"Screenshot Curation Interface\" \/><\/p>\n<\/div>\n\n<div class=\"gridRow\">\n<div class=\"gridWidth5 gridPos0\">\n<p>\nThe editors choose products for a further selection process and for the enrichment of the data. The web interface offers a plenty of filters to master the big amount of data. Besides very simple filtering options like “shop” or “price range” a keyword search and a filter for categories are provided. The differing categories from provider to provider can be mapped to a common category tree in the curating module. The category tree can be created in the web interface. The mapping of foreign category to local categories is done by an editor.\n<\/p>\n<\/div><div class=\"gridWidth5 gridPos5\">\n<p>\nTwo concepts to represent the category tree are used in the database:  an <a href=\"http:\/\/en.wikipedia.org\/wiki\/Adjacency_list\">adjacency list<\/a>, that means every category knows its parent category. With this the implementation of the tree management is easy. Besides that the informatio of the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Nested_set_model\">Nested-Set Model<\/a> are stored with the categories. So querying the tree is performant and easy.<\/p><p>\nFor the curation process I wrote a small JavaScript application that reduced loading times distinctly by using AJAX and simplified the server routines a lot. E.g.  the management of the application state takes place in the client and needed no server side implementation using sessions.\n<\/p>\n<\/div><\/div>\n<h2>Technology<\/h2>\n<div class=\"gridRow\">\n<p>\nThe server code is written with PHP 5. I used Composer with Symphony 2 as a framework and wrote a lot of custom code myself. The webinterface uses  RequireJS and jQuery and a whole lot of my own modules.\n<\/p>\n<\/div>\n<div class=\"diaryEntryFooter\"><a class=\"permalink\" href=\"\/en\/archive\/2013-11-12_iconic_imports\">Permalink<\/a> Tuesday, November 12, 2013 4:53:17 PM Europe\/Berlin<div class=\"filters\">Filters: <ul><li><a rel=\"tag\" href=\"\/en\/diary\/code\">Web and Code<\/a><\/li><\/ul><\/div><\/div><\/div>"}