{"title":"graphicore.de is online. | Diary entry | graphicore.de","languageSwitch":"<ul class=\"language-switch\"><li title=\"Zeige diese Seite auf Deutsch. Die Benutzerschnittstelle ist übersetzt, aber nicht unbedingt alle Artikel.\" class=\"first de\"  ><a hreflang=\"de\" rel=\"alternate\" href=\"\/de\/archive\/2010-07-09_i-live-again\">Deutsch<\/a><\/li><li title=\"Display this page in English. The interface is translated, but not all articles necessarily are.\" class=\"en active\"  ><a hreflang=\"en\" rel=\"alternate\" href=\"\/en\/archive\/2010-07-09_i-live-again\">English<\/a><\/li><\/ul>","type":"content","html":"<div class=\"contentContainer diaryEntry\" xml:lang=\"en\" lang=\"en\"><h1>graphicore.de is online.<\/h1><p class=\"teaser\">Lasse is glad to announce the completion of the latest version of graphicore.de. In the following, he will discuss some of the design decisions …<\/p><h2>Joy, Joy,<\/h2>\n\n<div class=\"gridRow\">\n<div class=\"gridPos0 gridWidth6\">\n\n<p>\nthe relaunch of my website is done. I will present my works here. I think the website is pretty much self-explanatory, so I will focus more the not so obvious things.\n<\/p><p>\nI decided to let the archive be empty at the beginning. So, dont't be surprised. That's because I want to take some time to process the projects appropriately. The page will evolve in a natural manner. After all a designer identifies himself with the documentation of his works—thus his portfolio.\n<\/p>\n<p>\nThere will be no comment feature. But I'm always excited about your emails and if its inevitable I'll let myself be carried away to fix it. The concern here is the presentation of my work and not the discussion about it. As well I don't want to moderate, what would be unavoidable with comments.\n<\/p>\n\n<\/div><div class=\"gridPos6 gridWidth4\">\n\n<p>\n<img src=\"\/images\/\/diary\/numero-uno-teaser.png\" alt=\"teaser for numero uno, a bitmap font by graphicore.de\" \/><\/p>\n<h3>Announcement<\/h3>\n<p>\nAs a birthday present of graphicore.de, as next action I'll publish the pixel font of the graphicore logo alongside with the code that built it, that I built, under a free license. The font now has ca. 220 glyphs and covers our western languages. The code is rather for tinkerers. Coming back pays off!\n<\/p>\n<\/div><\/div>\n\n<h2>What's under the hood?<\/h2>\n\n<div class=\"gridRow\">\n<div class=\"gridPos0 gridWidth4\">\n\n<p>\nI have to answer this here. Because I built the Content Management System myself. Those who aren't up for the technics may leave now.\n<\/p>\n<p>\n<a href=\"http:\/\/zendframework.com\/\" class=\"image\"><img class=\"gridGap\" alt=\"Zend Framework Logo\" src=\"\/images\/diary\/ZendFramework.png\" \/><\/a><a href=\"http:\/\/www.dojotoolkit.org\/\" class=\"image\"><img alt=\"Dojo Logo\" src=\"\/images\/diary\/dojo.png\" \/><\/a>\n<\/p><p><a href=\"http:\/\/www.doctrine-project.org\/\" class=\"image\"><img class=\"gridGap\" alt=\"doctrine Logo\" src=\"\/images\/diary\/doctrine.png\" \/><\/a><a href=\"http:\/\/htmlpurifier.org\/\" class=\"image\"><img alt=\"HTMLPurifier Logo\" src=\"\/images\/diary\/HTMLPurifier.png\" \/><\/a>\n<\/p>\n<h3>Markup<\/h3>\n<p>\nGraphicore.de validates <a href=\"http:\/\/validator.w3.org\/check?uri=referer\">here<\/a> as XHTML 1.0 Strict. That's important to me. Granted, the content-type is text\/html, but I have still the advantage of a strict syntax and its possible for me to use other XML tools on my output. An example in this case is the Atom-Feed.\n<\/p>\n\n<\/div><div class=\"gridPos4 gridWidth6\">\n\n<h3>Style<\/h3>\n<p>\n<a href=\"http:\/\/en.wikipedia.org\/wiki\/Progressive_enhancement\">Progressive enhancement<\/a>: I insisted on using some of the new CSS3 properties. Including gradients, pseudo elements, and naturally @font-fontface. It was important to me that the display works even in browsers that don't support these  features. The better the browser the better the display, quite simple.\n<\/p>\n<p>\nWith 1000px the page is rather wide relative to our screen technology. \nIn addition all contents load among one another and are therefore visible at the same time and directly compareable to each other. To keep the \ncoherency of the layout I set up both a layout grid as well as a baseline grid. The execution is rather primitive compared to the available CSS-Frameworks. But in exchange it fits into 130 generous lines and meets my requirements. The baselinegrid works in all modern browsers ;)\n<\/p>\n<p>Here it is: <img src=\"\/style\/images\/grid10.png\" alt=\"the element of the baselinegrid\" \/> the grid is a 24px high and 99px wide image that gets repeated over and over again. When I wrote the CSS I had the image occasionally in the background to check against it. <a href=\"javascript: dojo.toggleClass(dojo.body(),'grid')\">click here to see it in action<\/a>(JavaScript must be enabled).\n<\/p>\n\n<\/div>\n<\/div>\n<div class=\"gridRow\">\n<div class=\"gridPos0 gridWidth6\">\n\n<h3>Dynamic<\/h3>\n<p>I implemented the concept of <a href=\"http:\/\/en.wikipedia.org\/wiki\/Unobtrusive_JavaScript\">unobtrusive JavaScript<\/a>. That means the page works without JavaScript. However, if JavaScript is available the entertainment factor rises.<\/p>\n<p>For the dynamic behavior of the website with JavaScript I used the <a href=\"http:\/\/www.dojotoolkit.org\/\">Dojo Toolkit<\/a> for the first time. The handling of Dojo is similarly sleek as the handling of jQuery. I'm very satisfied with Dojo.<\/p>\n\n<h3>graphicore cache<\/h3>\n<p>\nOne thing I'm particularly proud of is my way of caching Ajax-Requests. A request gets always loaded in between the previous request and the main-menu. Before a request is made, if the result is loaded already, the page directly jumps to that location—the content is not loaded again.\n<br \/>If nobody made that before, I'd like to call it \"graphicore cache\" ;)\n<\/p>\n\n<\/div><div class=\"gridPos6 gridWidth4\">\n\n<h3>Backend<\/h3>\n<p>I will make it shorter than the denseness of topic propably demands. But this post must come to an end, too. I built the backend using <a href=\"http:\/\/zendframework.com\/\">Zend Framework<\/a>, <a href=\"http:\/\/www.doctrine-project.org\/\">Doctrine ORM<\/a> and <a href=\"http:\/\/htmlpurifier.org\/\">HTMLPurifier<\/a>. Besides that one and a half Libraries that I cobbled together are employed.\n\n<\/p><h3>i18n<\/h3>\n<p>\nOne reason for me to build the backend myself was the rather bad support of existing solutions for internationalization. It's possible for me to localize all areas of the website and so I did.\n<\/p>\n\n<\/div>\n<\/div><div class=\"diaryEntryFooter\"><a class=\"permalink\" href=\"\/en\/archive\/2010-07-09_i-live-again\">Permalink<\/a> Monday, July 12, 2010 3:23:56 AM Europe\/Berlin<div class=\"filters\">Filters: <ul><li><a rel=\"tag\" href=\"\/en\/diary\/news\">News<\/a><\/li><li><a rel=\"tag\" href=\"\/en\/diary\/code\">Web and Code<\/a><\/li><\/ul><\/div><\/div><\/div>"}