{"title":"Hello Metapolator | Diary entry | graphicore.de","languageSwitch":"<ul class=\"language-switch\"><li title=\"Zeige diese Seite auf Deutsch. Die Benutzerschnittstelle ist übersetzt, aber nicht unbedingt alle Artikel.\" class=\"first de\"  ><a hreflang=\"de\" rel=\"alternate\" href=\"\/de\/archive\/2015-07-28_hello_metapolator\">Deutsch<\/a><\/li><li title=\"Display this page in English. The interface is translated, but not all articles necessarily are.\" class=\"en active\"  ><a hreflang=\"en\" rel=\"alternate\" href=\"\/en\/archive\/2015-07-28_hello_metapolator\">English<\/a><\/li><\/ul>","type":"content","html":"<div class=\"contentContainer diaryEntry\" xml:lang=\"en\" lang=\"en\"><h1>Hello Metapolator<\/h1><p class=\"teaser\">Metapolator is a FLOSS type design tool that tackles the challenges of creating large font families by introducing a new approach of parametric design. Therefore it borrows ideas from Donald Knuth’s metafont and the DOM\/CSS web-API. Metapolator is written as a web application, running completely in the web browser.<\/p><p>Learn more about Metapolator and visit the <a href=\"http:\/\/metapolator.com\">project homepage<\/a> and the <a href=\"https:\/\/github.com\/metapolator\/metapolator\/\">github repository<\/a>.\n<\/p>\n\n\n<div class=\"gridRow\">\n<div class=\"gridWidth6 gridPos1\">\n<h2>A Short Personal Project History<\/h2>\n<p>\nThe reason for me not updating my blog for a long while is that I was very busy. I'm still busy now, but yet writing. Something must have changed.<br \/>\nMetapolator is a next generation font creation tool. I started working on it roughly more than one year ago. We can consider the <a href=\"http:\/\/libregraphicsmeeting.org\/2014\/\">Libre Graphics Meeting 2014<\/a> in Leipzig in April 2-5 as my initiation into the project and the start of the current phase. More about the project history can be found at <a href=\"http:\/\/metapolator.com\">metapolator.com<\/a>. Our Team gathered later that year again at the <a href=\"http:\/\/automatic-type-design.anrt-nancy.fr\/index_en.php\">Automatic Type Design conference<\/a> at the ANRT in Nancy in May 6-7 2014. In the meantime I was working on the previous prototype of Metapolator and shaped my mind about what it did then and what I thought it should be. It was in Nancy where we laid the foundation for the current incarnation of Metapolator technology.<br \/>\nMany people contributed to the project, but at Nancy I met <em>Paul Sladen<\/em>, whose kind help, being a good listener, and giving valuable advice, helped me to form concepts strong enough to get my hands dirty and start working. <strong>I left Nancy with a keen excitement in the project.<\/strong>\n<\/p>\n<\/div><\/div>\n<div class=\"gridRow\">\n<div class=\"gridWidth6 gridPos3\">\n<h2>Things keep changing<\/h2>\n<p>\nAfter more than one year later the Metapolator Project entered an interesting new phase. Some of the old concepts got replaced by better ones but the general direction has proven right. We have a great product vision and a well conceived ux-design through the work of <em>Peter Sikking<\/em>. Soon we will present a minimal viable product that supports designers with designing font families. To implement all of our plans and to reach version 1.0 will take some more time however.\n<\/p><p>\nMy role in the project is less about the creation of the <strong>“Metapolator” interface<\/strong>; instead I am the inventor of the underlying <strong>“Metapolator Technology”<\/strong>. There are a couple of modules that I realized will be useful in a vastly broader range of applications and tools than just Metapolator. This led to my decision to take parts out of the repositories of Metapolator, and also <a href=\"https:\/\/github.com\/graphicore\/ufoJS\/\">ufoJS<\/a>, a library I began developing <a href=\"\/en\/archive\/2012-01-17_ufoJS-is-not-a-bird\">some years ago<\/a> that is a key component of Metapolator.\n<\/p>\n<\/div><\/div>\n<div class=\"gridRow\">\n<div class=\"gridWidth6 gridPos1\">\n<h2>The Plan<\/h2>\n<p><strong>\nI hope I can use parts of Metapolator, especially <em title=\"Cascading Properties Sheets\">CPS<\/em>, to teach people how to make exciting new tools for font and graphic design.<\/strong>\n<\/p><p>\nTaking modules out of Metapolator to create stand-alone projects has primarily didactical reasons. It will be easier to <strong>show and explain<\/strong> the technology of Metapolator by looking at one part at a the time, instead of everything at once. It will also be easier to <strong>write specific documentation<\/strong> for these projects without having to consider the highly specialized nature of Metapolator. Lastly and most exciting for me: we will be able to create cool little projects with our technology to <strong>attract, inspire and teach<\/strong> the community. These projects will form an ecosystem  around Metapolator: The developer tool for <em title=\"Cascading Properties Sheets\">CPS<\/em> that I'm working on right now will be available for all <em title=\"Cascading Properties Sheets\">CPS<\/em> based projects as an ad-hoc interface.\n<\/p><p>\nIn the long run we will establish <strong>Metapolator technology as a platform to build the next generation of type design tools<\/strong>, or any other domain as well. Metapolator will be positioned as a highly sophisticated application that spawned new core technologies and on the way stimulates and enables new tools.\n<\/p><p>\nI want to see more people participating in Metapolator technology in the future; particularly because we offer <strong>interesting and genuinely new approaches for parametric design applications<\/strong>, and can enable everything between professional type design\/engineering tools to ultra creative graphic design tools <em>that are fun both to make and to use<\/em>.\n<\/p><p>\nFor a FLOSS project like ours it is crucial to gain a diverse community. Each part of the project will profit from discussing and solving issues raised by users from any background. <strong>We have topics ranging from computer language design to user interaction<\/strong>. The more people use our tools the more ideas and feedback will be available to further advance our mission.\n<\/p>\n<\/div><\/div>\n<div class=\"gridRow\">\n<div class=\"gridWidth6 gridPos3\">\n\n<h2>Coming up next<\/h2>\n\n<p>\nMetapolator’s minimal viable product and the <em title=\"Cascading Properties Sheets\">CPS<\/em> Developer Tool are being developed in parallel at the moment. When I have finished the developer tool I will start to <strong>decouple some modules<\/strong>, namely: <em title=\"Cascading Properties Sheets\">CPS<\/em> plus the object model basics, <em title=\"Metapolator Object Model\">MOM<\/em> (maybe), our IO modules, the pen APIs and a collection of pens, and the <em title=\"Cascading Properties Sheets\">CPS<\/em> Developer Tool itself. I am also planning <strong>a series of blog posts<\/strong> to document the workings of these modules on a fairly high level and finally one about  Metapolator that builds upon that knowledge. These articles will become part of the Metapolator documentation as well. I also have ideas for up to three <strong>fun projects<\/strong> that will prove the claims I made above and attract new people to this ecosystem; I expect one of these will be created soon after the isolation of <em title=\"Cascading Properties Sheets\">CPS<\/em>.\n<\/p>\n\n<h3>Comments<\/h3>\n<p>I have no comments feature on my blog for several reasons. You can discuss this post at the <a href=\"https:\/\/plus.google.com\/+LasseFister\/posts\/9BUVmNzQJCx\">Metapolator g+ community<\/a>, write me an email or chat to me on twitter.<\/p>\n<\/div><\/div><div class=\"diaryEntryFooter\"><a class=\"permalink\" href=\"\/en\/archive\/2015-07-28_hello_metapolator\">Permalink<\/a> Tuesday, July 28, 2015 2:45:00 PM Europe\/Berlin<div class=\"filters\">Filters: <ul><li><a rel=\"tag\" href=\"\/en\/diary\/code\">Web and Code<\/a><\/li><li><a rel=\"tag\" href=\"\/en\/diary\/news\">News<\/a><\/li><li><a rel=\"tag\" href=\"\/en\/diary\/conception\">Conception<\/a><\/li><\/ul><\/div><\/div><\/div>"}