{"title":"graphicore.de ist online. | Tagebucheintrag | graphicore.de","languageSwitch":"<ul class=\"language-switch\"><li title=\"Zeige diese Seite auf Deutsch. Die Benutzerschnittstelle ist übersetzt, aber nicht unbedingt alle Artikel.\" class=\"first de active\"  ><a hreflang=\"de\" rel=\"alternate\" href=\"\/de\/archive\/2010-07-09_i-live-again\">Deutsch<\/a><\/li><li title=\"Display this page in English. The interface is translated, but not all articles necessarily are.\" class=\"en\"  ><a hreflang=\"en\" rel=\"alternate\" href=\"\/en\/archive\/2010-07-09_i-live-again\">English<\/a><\/li><\/ul>","type":"content","html":"<div class=\"contentContainer diaryEntry\" xml:lang=\"de\" lang=\"de\"><h1>graphicore.de ist online.<\/h1><p class=\"teaser\">Lasse ist froh, die Fertigstellung der neusten Version von graphicore.de  bekannt zu geben. Im Folgenden wird er einige der Designentscheidungen besprechen …\n<\/p><h2>Freude, Freude,<\/h2>\n\n<div class=\"gridRow\">\n<div class=\"gridPos0 gridWidth6\">\n\n<p>\nder Relaunch meiner Website ist fertig. Ich werde hier meine Arbeiten präsentieren. Ich denke, die Seite ist zu einem Großteil selbsterklärend, also werde ich mehr die nicht so offensichtlichen Dinge fokussieren.\n<\/p><p>\nIch habe mich entschieden, das Archiv zu Beginn leer zu lassen. Also, nicht wundern. Denn ich möchte mir etwas Zeit nehmen, um die Projekte angemessen aufzuarbeiten. Die Seite wird sich auf natürliche Weise entwickeln. Schließlich weist sich ein Designer durch die Dokumentation seiner Werke aus – also durch sein Portfolio.\n<\/p>\n<p>\nEs wird hier keine Kommentarfunktion geben. Ich freue mich aber immer über eure Emails und werde mich, falls es unvermeidbar wird, zum Nachbessern hinreißen lassen. Das Anliegen hier ist die Präsentation meiner Arbeit, nicht die Diskussion darüber. Auch möchte ich nicht moderieren müssen, was mit Kommentaren unvermeidbar wäre.\n<\/p>\n\n<\/div><div class=\"gridPos6 gridWidth4\">\n<p>\n<img src=\"\/images\/\/diary\/numero-uno-teaser.png\" alt=\"teaser for numero uno, a bitmap font by graphicore.de\" \/><\/p>\n<p>\n<\/p><h3>Ankündigung<\/h3>\nAls Geschenk zum Geburtstag von graphicore.de werde ich als nächste Aktion die Pixelschrift aus dem graphicore Logo sowie den Code der sie gebaut hat – den ich gebaut habe – unter einer freien Lizenz veröffentlichen. Der Font hat momentan ca. 220 Zeichen und deckt unsere westlichen Sprachen ab. Der Code ist aber eher was für Bastler. Wiederkommen lohnt sich!\n\n\n<\/div><\/div>\n\n<h2>Was unter der Haube steckt,<\/h2>\n\n<div class=\"gridRow\">\n<div class=\"gridPos0 gridWidth4\">\n\n<p>\nmuss ich hier auch erwähnen. Denn das Content Management System habe ich selbst gebaut. Wer für das Technische nicht zu haben ist, darf jetzt gehen.\n<\/p>\n<p>\n<a href=\"http:\/\/zendframework.com\/\" class=\"image\"><img class=\"gridGap\" alt=\"Zend Framework Logo\" src=\"\/images\/diary\/ZendFramework.png\" \/><\/a><a href=\"http:\/\/www.dojotoolkit.org\/\" class=\"image\"><img alt=\"Dojo Logo\" src=\"\/images\/diary\/dojo.png\" \/><\/a>\n<\/p><p><a href=\"http:\/\/www.doctrine-project.org\/\" class=\"image\"><img class=\"gridGap\" alt=\"doctrine Logo\" src=\"\/images\/diary\/doctrine.png\" \/><\/a><a href=\"http:\/\/htmlpurifier.org\/\" class=\"image\"><img alt=\"HTMLPurifier Logo\" src=\"\/images\/diary\/HTMLPurifier.png\" \/><\/a>\n<\/p>\n<h3>Markup<\/h3>\n<p>\nGraphicore.de validiert <a href=\"http:\/\/validator.w3.org\/check?uri=referer\">hier<\/a> als XHTML 1.0 Strict, was mir sehr wichtig ist. Zugegeben, der Content-type ist text\/html, trotzdem habe ich den Vorteil einer strikten Syntax, und es ist mir möglich, andere XML-Tools mit meinem Output zu verwenden. Ein Beispiel in diesem Fall ist der Atom-Feed.\n<\/p>\n\n<\/div><div class=\"gridPos4 gridWidth6\">\n\n<h3>Style<\/h3>\n<p>\n<a href=\"http:\/\/de.wikipedia.org\/wiki\/Progressive_Verbesserung\">Progressive Verbesserung<\/a>: Ich habe es mir nicht nehmen lassen, einige der neuen CSS3 Eigenschaften zu nutzen. Dazu zählen Farbverläufe, Pseudoelemente und natürlich @font-fontface. Wichtig war mir dabei, dass auch in Browsern, die diese Eigenschaften nicht unterstützen, die Anzeige funktioniert. Je besser der Browser, desto besser die Anzeige, ganz einfach.\n<\/p>\n<p>\nDie Seite ist mit 1000px – relativ zu unserer Bildschirmtechnologie – eher breit. Zudem laden alle Inhalte untereinander, sind also gleichzeitig zu sehen und dadurch direkt vergleichbar. Um die gestalterische Kohärenz zu wahren, habe ich ein Gestaltungs- sowie ein Grundlinienraster eingerichtet. Die Ausführung ist im Vergleich zu den verfügbaren CSS-Frameworks eher primitiv, passt dafür aber auf großzügige 130 Zeilen und genügt meinen Ansprüchen. Das Grundlinienraster funktioniert in allen modernen Browsern ;)\n<\/p>\n<p>Hier ist es: »<img src=\"\/style\/images\/grid10.png\" alt=\"das Element des Grundlinienrasters\" \/>«. Das Raster ist ein 24px hohes und 99px breites Bild, das ständig wiederholt wird. Als ich das CSS geschrieben habe, hatte ich das Bild gelegentlich im Hintergrund, um damit das Raster zu vergleichen. <a href=\"javascript: dojo.toggleClass(dojo.body(),'grid')\">Klicke hier um es in Aktion zu sehen<\/a>(JavaScript muss an sein).\n<\/p>\n\n<\/div>\n<\/div>\n<div class=\"gridRow\">\n<div class=\"gridPos0 gridWidth6\">\n\n<h3>Dynamic<\/h3>\n<p>Ich habe das Konzept des <a href=\"http:\/\/en.wikipedia.org\/wiki\/Unobtrusive_JavaScript\" title=\"unaufdringliches JavaScript\">unobtrusive JavaScript<\/a> umgesetzt. Das heißt, die Seite funktioniert ohne JavaScript. Ist aber JavaScript vorhanden, wird der Unterhaltungsfaktor größer.<\/p>\n<p>Für das dynamische Vehalten der Website mit JavaScript habe ich erstmals das <a href=\"http:\/\/www.dojotoolkit.org\/\">Dojo Toolkit<\/a> verwendet. Mit Dojo lässt sich – ähnlich wie mit jQuery – geschmeidig umgehen. Ich bin mit Dojo sehr zufrieden.<\/p>\n\n<h3>graphicore cache<\/h3>\n<p>\nEine Sache, auf die ich besonders Stolz bin, ist meine Art Ajax-Requests zu cachen. Eine Anfrage wird stets zwischen der voherigen Anfrage und dem Hauptmenü geladen. Bevor eine Anfrage abgeschickt wird, falls das Ergebnis schon geladen ist, wird direkt an diese Stelle gesprungen – der Inhalt wird nicht erneut geladen.\n<br \/>Falls das nicht vormals gemacht wurde, möchte ich es gerne »graphicore cache« nennen ;)\n<\/p>\n\n<\/div><div class=\"gridPos6 gridWidth4\">\n\n<h3>Backend<\/h3>\n<p>\nIch werde mich hier kürzer fassen, als es die Dichte des Themas möglicherweise erfordert. Aber auch dieses Post muss zu einem Ende kommen. \nIch habe mit dem <a href=\"http:\/\/zendframework.com\/\">Zend Framework<\/a>, <a href=\"http:\/\/www.doctrine-project.org\/\">Doctrine ORM<\/a> und <a href=\"http:\/\/htmlpurifier.org\/\">HTMLPurifiers<\/a> das Backend gebaut. Dabei kommen auch eineinhalb Bibliotheken, die ich zusammengeschustert habe, zum Einsatz.\n<\/p>\n<h3>i18n<\/h3>\n<p>\nEin Grund für mich, das Backend selbst zu bauen, war die eher schlechte Unterstützung existierender Lösungen für Internationalisierung. Es ist mir möglich, alle Bereiche der Webseite zu lokalisieren, und das habe ich gemacht.\n<\/p>\n\n\n<\/div>\n<\/div><div class=\"diaryEntryFooter\"><a class=\"permalink\" href=\"\/de\/archive\/2010-07-09_i-live-again\">Permalink<\/a> Montag, 12. Juli 2010 03:23:56 Europe\/Berlin<div class=\"filters\">Filter: <ul><li><a rel=\"tag\" href=\"\/de\/diary\/news\">Neues<\/a><\/li><li><a rel=\"tag\" href=\"\/de\/diary\/code\">Web und Code<\/a><\/li><\/ul><\/div><\/div><\/div>"}