{"title":"Cinecita.org | Tagebucheintrag | graphicore.de","languageSwitch":"<ul class=\"language-switch\"><li title=\"Zeige diese Seite auf Deutsch. Die Benutzerschnittstelle ist übersetzt, aber nicht unbedingt alle Artikel.\" class=\"first de active\"  ><a hreflang=\"de\" rel=\"alternate\" href=\"\/de\/archive\/2010-10-18_La_Mirada_de_Ella\">Deutsch<\/a><\/li><li title=\"Display this page in English. The interface is translated, but not all articles necessarily are.\" class=\"en\"  ><a hreflang=\"en\" rel=\"alternate\" href=\"\/en\/archive\/2010-10-18_La_Mirada_de_Ella\">English<\/a><\/li><\/ul>","type":"content","html":"<div class=\"contentContainer diaryEntry\" xml:lang=\"de\" lang=\"de\"><h1>Cinecita.org<\/h1><p class=\"teaser\">CineCita ist ein reisendes Kino- und Videolabor, unterwegs in den zentralen Anden im Herbst 2010. Ich habe die Webseite gemacht: Frontend und Content-Management-System.<\/p><p><a href=\"http:\/\/www.cinecita.org\">http:\/\/www.cinecita.org<\/a><\/p>\n<div class=\"gridRow\">\n<div class=\"gridWidth10 gridPos0\">\n<p><img src=\"\/images\/diary\/cinecita_homepage.png\" alt=\"Bildschirmfoto der the CineCita Webseite auf english den folgenden Text abbildend: CineCita is a travelling cinema and video laboratory, that will be on tour in the Central Andes in the fall of 2010. CineCita aims to improve general access to audiovisual media and to increase media literacy with rural populations in the region. During the tour, a smart travelling “cine-bus” visits villages in Ecuador, Peru and Bolivia, screening a selected programme of international short films and organizing participative video workshops for local communities.  Screenings are free of charge and held at public places. The selected programme focuses on female perspectives, giving a voice to women’s narratives, from both Europe and Latin America. In the video workshops, young women learn to shoot their own short documentary video, empowering them with audiovisual skills and inspiring them to tell their own stories. An international team of organizers accompanies the workshop participants, while documenting an excerpt of their everyday lives on video themselves. Together, screenings and workshops provide a means of an exchange and networking between the Central Andean Region and Europe.  At the conclusion of each tour stop, the young directors may present their work in form of a public screening. Their films are then sent on the road with CineCita and shown to further audiences in the region.\" \/><\/p>\n<\/div>\n\n<\/div><div class=\"gridRow\">\n<h2>Umsetzung<\/h2>\n<div class=\"gridWidth5 gridPos0\">\n<h3>Content Management<\/h3>\n<p>Die Seite läuft mit einem speziell angefertigtem Content-Management-System. Ich habe es mit <a href=\"http:\/\/php.net\/\">PHP5<\/a>, <a href=\"http:\/\/zendframework.com\/\">Zend Framework<\/a>, <a href=\"http:\/\/www.doctrine-project.org\/\">Doctrine ORM<\/a> und <a href=\"http:\/\/htmlpurifier.org\/\">HTMLPurifier<\/a> gemacht. Cinecita.org ist der technische Vorgänger von graphicore.de.<\/p>\n<h3>Internationalisierung<\/h3>\n<p>Englisch und Spanisch waren notwendig. Die meisten fertig benutzbaren CMSe haben mittelmäßige Unterstützung für Internationalisierung. Dieses CMS war von Beginn an mit mehreren Sprachen im Hinterkopf geplant. Die Übersetzung ist das einzige was zu tun ist, falls aber eine Übersetzung fehlt, wird auf eine verfügbare zurück gegriffen. Die Anzahl der Sprachen ist technisch nicht begrenzt.<\/p>\n\n<h3><a href=\"http:\/\/www.cinecita.org\/en\/index\/diary\/\">Blog<\/a><\/h3>\n<p>Die Seite hat einen komplett integrierten Blog mit eingebautem ATOM und RSS Newsfeed. Einige Teile der Webseite werden vom CineCita-Personal während sie auf Tour sind verändert. Sie können einen WYSIWYG-Editor benutzen und müssen nicht so viel mit HTML herumbasteln.<\/p>\n<\/div><div class=\"gridWidth5 gridPos5\">\n<h3><a href=\"http:\/\/www.cinecita.org\/en\/index\/static\/static\/tour\">Eine interaktive Karte<\/a><\/h3>\n<p>bietet eine schnelle Übersicht des CineCita Tourplans und lässt den Benutzer durch die Tourstops navigieren. Die Ergebnisse der von CineCita abgehaltenen Workshops werden dort verfügbar sein.<\/p>\n<h3>Animationen<\/h3>\n<p>transportieren Emotionen. Das müsst ihr euch auf der Life-Seite anschauen. Die Kopfleiste ist überall animiert und wenn ein Untermenü geladen wird öffnet das kleine Mädchen in der linken oberen Ecke den Vorhang. Überhaupt kein Flash wurde benutzt, wir haben ausprobiert wie weit wir ohne gehen konnten. Frontend-Tools waren <a href=\"http:\/\/jquery.com\/\">jQuery<\/a>, <a href=\"http:\/\/flowplayer.org\/tools\/index.html\">jQuery Tools<\/a> und natürlich <a href=\"http:\/\/www.w3.org\/TR\/xhtml1\/\">XHTML 1.0 Strict<\/a><\/p>\n\n<h3>Ajax<\/h3>\n<p>Progressive Verbesserung gewährleistet, dass die Seite gut ohne Javascript funktioniert. Jedoch – falls Javascript läuft – werden die Inhalte zwischengespeichert und das Seitengerüst muss nicht jedes mal neu angefragt werden. Das lässt intakt, wie sich die Seite anfühlt, und verbessert die Kontrolle über den animierten Vorhang.<\/p>\n<\/div>\n\n<\/div><div class=\"gridRow\">\n\n<div class=\"gridWidth10 gridPos0\">\n<p><img src=\"\/images\/diary\/cinecita_interactive-map.png\" alt=\"Bildschirmfoto der CineCita-Webseite auf spanisch. Zeigt eine Karte mit einigen Punkten die für Tourstops stehen. Über einem Tourstop ist eine Sprechblase sichtbar, die den Namen und das Datum des Tourstops anzeigt.\" \/><\/p>\n<\/div>\n\n<\/div><div class=\"gridRow\">\n<hr \/><div class=\"gridWidth4 gridPos0\">\n<h2>Die Mediendaten sind ausgegliedert<\/h2>\n<h3>Videos<\/h3>\n<p>sind die Kernmedien von CineCita. Bei <a href=\"http:\/\/www.cinecita.org\/en\/index\/static\/static\/workshops\">Workshops<\/a> werden Videos von lokalen Mädchen und Frauen produziert. Die Videos werden von den guten und skalierenden Diensten von <a href=\"http:\/\/vimeo.com\/\">Vimeo<\/a> oder <a href=\"http:\/\/www.youtube.com\">YouTube<\/a> ausgeliefert.<\/p>\n<h3>Die eingebundenen Diashows<\/h3>\n<p>laden Fotoalben von <a href=\"http:\/\/picasaweb.google.com\">Googles Picasa<\/a> und zeigen diese im Artikel an. Die CineCita-Leute benutzen diese Funktion <a href=\"http:\/\/www.cinecita.org\/en\/index\/diary\/filter\/photo\">häufig in ihren Blog-Artikeln<\/a> um die wundervollen Plätze zu zeigen, die sie auf ihrer Reise besuchen. <\/p><p>Der Code ist eine stark modifizierte Version von <a href=\"http:\/\/pwi.googlecode.com\/\">pwi - Picasa Webalbum Integrator<\/a>. Das Beste: die schwere Arbeit des massiven auslieferns von Bildern wird von Google gemacht.<\/p>\n<h2>Das Grafikdesign<\/h2>\n<p>ist von <a href=\"http:\/\/10hoch16.de\">10hoch16.de.<\/a><\/p>\n<\/div>\n<div class=\"gridWidth6 gridPos4\">\n<p><img src=\"\/images\/diary\/cinecita_embedded-slideshow.png\" alt=\"Teil eines Bildschirmfotos der CineCita Webseite, eine eingebundene Diashow zeigend. Ein großes Bild und darunter eine Zeile Thumbnail-Bilder.\" \/><\/p>\n<\/div>\n<\/div><div class=\"diaryEntryFooter\"><a class=\"permalink\" href=\"\/de\/archive\/2010-10-18_La_Mirada_de_Ella\">Permalink<\/a> Montag, 3. Mai 2010 15:38:23 Europe\/Berlin<div class=\"filters\">Filter: <ul><li><a rel=\"tag\" href=\"\/de\/diary\/code\">Web und Code<\/a><\/li><\/ul><\/div><\/div><\/div>"}